# Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series(data = np.array([100,200,300,400]), index = ['a', 'b', 'c', 'd'])    #Creating a pandas series

In [3]:
s

a    100
b    200
c    300
d    400
dtype: int32

In [4]:
sd = pd.Series(data = {'a':10, 'b':20, 'c':30})        #Creating series with dictionary

In [5]:
sd

a    10
b    20
c    30
dtype: int64

In [6]:
s[3]        #Extract value of series s at index 3

400

In [7]:
sd[2]       #Extract value of series sd at index 2

30

In [8]:
s[:2]       #Extract first 2 elements of series s

a    100
b    200
dtype: int32

In [9]:
s[1:]      #Extract values from index 1 till the end of series s

b    200
c    300
d    400
dtype: int32

In [10]:
s['b']     #Extract data from series s at index b

200

In [11]:
s['a':'c']     #Extract data from series s from index a to c

a    100
b    200
c    300
dtype: int32

In [12]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])     #Creating a pandas dataframe

In [13]:
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [14]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [15]:
df[df['Age'] < 12]                     #Select data from DataFrame df where Age is less than 12

   Name  Age
0  Alex   10

In [16]:
df[df['Age'] > df['Age'].mean()]           #Filter data from df where Age is greater than mean Age

     Name  Age
1     Bob   12
2  Clarke   13

In [17]:
test_df_1 = pd.DataFrame({'Length':[100,151,87],
                         'Breadth':[45,73,76]})
test_df_1

   Breadth  Length
0       45     100
1       73     151
2       76      87

In [18]:
test_df_2 = pd.DataFrame({'Height':[53,98,70]})
test_df_2

   Height
0      53
1      98
2      70

In [19]:
test_df_3 = pd.concat([test_df_1,test_df_2], axis=1)     #Concatenate two arrays column-wise
test_df_3

   Breadth  Length  Height
0       45     100      53
1       73     151      98
2       76      87      70

In [20]:
df_a = pd.DataFrame({'Count':['A','B'],'a':[100, 150], 'b': [200, 250], 'c':[300, 350]})
df_a

  Count    a    b    c
0     A  100  200  300
1     B  150  250  350

In [21]:
df_b = pd.DataFrame({'Count':['A','B'],'d':[400,450], 'e':[500,550]})
df_b

  Count    d    e
0     A  400  500
1     B  450  550

In [22]:
pd.merge(df_a,df_b)         #Merge two dataframes based on common column 'Count'

  Count    a    b    c    d    e
0     A  100  200  300  400  500
1     B  150  250  350  450  550